STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_cm33.h
/****************  Bit definition for DCACHE_RMMONR register  *****************/
#define DCACHE_RMMONR_RMISSMON_Pos          (0U)
#define DCACHE_RMMONR_RMISSMON_Msk          (0xFFFFUL << DCACHE_RMMONR_RMISSMON_Pos)         /*!< 0x0000FFFF */
#define DCACHE_RMMONR_RMISSMON              DCACHE_RMMONR_RMISSMON_Msk                      /*!< cache read-miss monitor counter */
#define DCACHE_RMMONR_RMISSMON_0            (0x1UL << DCACHE_RMMONR_RMISSMON_Pos)            /*!< 0x00000001 */
#define DCACHE_RMMONR_RMISSMON_1            (0x2UL << DCACHE_RMMONR_RMISSMON_Pos)            /*!< 0x00000002 */
#define DCACHE_RMMONR_RMISSMON_2            (0x4UL << DCACHE_RMMONR_RMISSMON_Pos)            /*!< 0x00000004 */
#define DCACHE_RMMONR_RMISSMON_3            (0x8UL << DCACHE_RMMONR_RMISSMON_Pos)            /*!< 0x00000008 */
#define DCACHE_RMMONR_RMISSMON_4            (0x10UL << DCACHE_RMMONR_RMISSMON_Pos)           /*!< 0x00000010 */
#define DCACHE_RMMONR_RMISSMON_5            (0x20UL << DCACHE_RMMONR_RMISSMON_Pos)           /*!< 0x00000020 */
#define DCACHE_RMMONR_RMISSMON_6            (0x40UL << DCACHE_RMMONR_RMISSMON_Pos)           /*!< 0x00000040 */
#define DCACHE_RMMONR_RMISSMON_7            (0x80UL << DCACHE_RMMONR_RMISSMON_Pos)           /*!< 0x00000080 */
#define DCACHE_RMMONR_RMISSMON_8            (0x100UL << DCACHE_RMMONR_RMISSMON_Pos)          /*!< 0x00000100 */
#define DCACHE_RMMONR_RMISSMON_9            (0x200UL << DCACHE_RMMONR_RMISSMON_Pos)          /*!< 0x00000200 */
#define DCACHE_RMMONR_RMISSMON_10           (0x400UL << DCACHE_RMMONR_RMISSMON_Pos)          /*!< 0x00000400 */
#define DCACHE_RMMONR_RMISSMON_11           (0x800UL << DCACHE_RMMONR_RMISSMON_Pos)          /*!< 0x00000800 */
#define DCACHE_RMMONR_RMISSMON_12           (0x1000UL << DCACHE_RMMONR_RMISSMON_Pos)         /*!< 0x00001000 */
#define DCACHE_RMMONR_RMISSMON_13           (0x2000UL << DCACHE_RMMONR_RMISSMON_Pos)         /*!< 0x00002000 */
#define DCACHE_RMMONR_RMISSMON_14           (0x4000UL << DCACHE_RMMONR_RMISSMON_Pos)         /*!< 0x00004000 */
#define DCACHE_RMMONR_RMISSMON_15           (0x8000UL << DCACHE_RMMONR_RMISSMON_Pos)         /*!< 0x00008000 */

/****************  Bit definition for DCACHE_WHMONR register  *****************/
#define DCACHE_WHMONR_WHITMON_Pos           (0U)
#define DCACHE_WHMONR_WHITMON_Msk           (0xFFFFFFFFUL << DCACHE_WHMONR_WHITMON_Pos)      /*!< 0xFFFFFFFF */
#define DCACHE_WHMONR_WHITMON               DCACHE_WHMONR_WHITMON_Msk                       /*!< cache write-hit monitor counter */
#define DCACHE_WHMONR_WHITMON_0             (0x1UL << DCACHE_WHMONR_WHITMON_Pos)             /*!< 0x00000001 */
#define DCACHE_WHMONR_WHITMON_1             (0x2UL << DCACHE_WHMONR_WHITMON_Pos)             /*!< 0x00000002 */
#define DCACHE_WHMONR_WHITMON_2             (0x4UL << DCACHE_WHMONR_WHITMON_Pos)             /*!< 0x00000004 */
#define DCACHE_WHMONR_WHITMON_3             (0x8UL << DCACHE_WHMONR_WHITMON_Pos)             /*!< 0x00000008 */
#define DCACHE_WHMONR_WHITMON_4             (0x10UL << DCACHE_WHMONR_WHITMON_Pos)            /*!< 0x00000010 */
#define DCACHE_WHMONR_WHITMON_5             (0x20UL << DCACHE_WHMONR_WHITMON_Pos)            /*!< 0x00000020 */
#define DCACHE_WHMONR_WHITMON_6             (0x40UL << DCACHE_WHMONR_WHITMON_Pos)            /*!< 0x00000040 */
#define DCACHE_WHMONR_WHITMON_7             (0x80UL << DCACHE_WHMONR_WHITMON_Pos)            /*!< 0x00000080 */
#define DCACHE_WHMONR_WHITMON_8             (0x100UL << DCACHE_WHMONR_WHITMON_Pos)           /*!< 0x00000100 */
#define DCACHE_WHMONR_WHITMON_9             (0x200UL << DCACHE_WHMONR_WHITMON_Pos)           /*!< 0x00000200 */
#define DCACHE_WHMONR_WHITMON_10            (0x400UL << DCACHE_WHMONR_WHITMON_Pos)           /*!< 0x00000400 */
#define DCACHE_WHMONR_WHITMON_11            (0x800UL << DCACHE_WHMONR_WHITMON_Pos)           /*!< 0x00000800 */
#define DCACHE_WHMONR_WHITMON_12            (0x1000UL << DCACHE_WHMONR_WHITMON_Pos)          /*!< 0x00001000 */
#define DCACHE_WHMONR_WHITMON_13            (0x2000UL << DCACHE_WHMONR_WHITMON_Pos)          /*!< 0x00002000 */
#define DCACHE_WHMONR_WHITMON_14            (0x4000UL << DCACHE_WHMONR_WHITMON_Pos)          /*!< 0x00004000 */
#define DCACHE_WHMONR_WHITMON_15            (0x8000UL << DCACHE_WHMONR_WHITMON_Pos)          /*!< 0x00008000 */
#define DCACHE_WHMONR_WHITMON_16            (0x10000UL << DCACHE_WHMONR_WHITMON_Pos)         /*!< 0x00010000 */
#define DCACHE_WHMONR_WHITMON_17            (0x20000UL << DCACHE_WHMONR_WHITMON_Pos)         /*!< 0x00020000 */
#define DCACHE_WHMONR_WHITMON_18            (0x40000UL << DCACHE_WHMONR_WHITMON_Pos)         /*!< 0x00040000 */
#define DCACHE_WHMONR_WHITMON_19            (0x80000UL << DCACHE_WHMONR_WHITMON_Pos)         /*!< 0x00080000 */
#define DCACHE_WHMONR_WHITMON_20            (0x100000UL << DCACHE_WHMONR_WHITMON_Pos)        /*!< 0x00100000 */
#define DCACHE_WHMONR_WHITMON_21            (0x200000UL << DCACHE_WHMONR_WHITMON_Pos)        /*!< 0x00200000 */
#define DCACHE_WHMONR_WHITMON_22            (0x400000UL << DCACHE_WHMONR_WHITMON_Pos)        /*!< 0x00400000 */
#define DCACHE_WHMONR_WHITMON_23            (0x800000UL << DCACHE_WHMONR_WHITMON_Pos)        /*!< 0x00800000 */
#define DCACHE_WHMONR_WHITMON_24            (0x1000000UL << DCACHE_WHMONR_WHITMON_Pos)       /*!< 0x01000000 */
#define DCACHE_WHMONR_WHITMON_25            (0x2000000UL << DCACHE_WHMONR_WHITMON_Pos)       /*!< 0x02000000 */
#define DCACHE_WHMONR_WHITMON_26            (0x4000000UL << DCACHE_WHMONR_WHITMON_Pos)       /*!< 0x04000000 */
#define DCACHE_WHMONR_WHITMON_27            (0x8000000UL << DCACHE_WHMONR_WHITMON_Pos)       /*!< 0x08000000 */
#define DCACHE_WHMONR_WHITMON_28            (0x10000000UL << DCACHE_WHMONR_WHITMON_Pos)      /*!< 0x10000000 */
#define DCACHE_WHMONR_WHITMON_29            (0x20000000UL << DCACHE_WHMONR_WHITMON_Pos)      /*!< 0x20000000 */
#define DCACHE_WHMONR_WHITMON_30            (0x40000000UL << DCACHE_WHMONR_WHITMON_Pos)      /*!< 0x40000000 */
#define DCACHE_WHMONR_WHITMON_31            (0x80000000UL << DCACHE_WHMONR_WHITMON_Pos)      /*!< 0x80000000 */

/****************  Bit definition for DCACHE_WMMONR register  *****************/
#define DCACHE_WMMONR_WMISSMON_Pos          (0U)
#define DCACHE_WMMONR_WMISSMON_Msk          (0xFFFFUL << DCACHE_WMMONR_WMISSMON_Pos)         /*!< 0x0000FFFF */
#define DCACHE_WMMONR_WMISSMON              DCACHE_WMMONR_WMISSMON_Msk                      /*!< cache write-miss monitor counter */
#define DCACHE_WMMONR_WMISSMON_0            (0x1UL << DCACHE_WMMONR_WMISSMON_Pos)            /*!< 0x00000001 */
#define DCACHE_WMMONR_WMISSMON_1            (0x2UL << DCACHE_WMMONR_WMISSMON_Pos)            /*!< 0x00000002 */
#define DCACHE_WMMONR_WMISSMON_2            (0x4UL << DCACHE_WMMONR_WMISSMON_Pos)            /*!< 0x00000004 */
#define DCACHE_WMMONR_WMISSMON_3            (0x8UL << DCACHE_WMMONR_WMISSMON_Pos)            /*!< 0x00000008 */
#define DCACHE_WMMONR_WMISSMON_4            (0x10UL << DCACHE_WMMONR_WMISSMON_Pos)           /*!< 0x00000010 */
#define DCACHE_WMMONR_WMISSMON_5            (0x20UL << DCACHE_WMMONR_WMISSMON_Pos)           /*!< 0x00000020 */
#define DCACHE_WMMONR_WMISSMON_6            (0x40UL << DCACHE_WMMONR_WMISSMON_Pos)           /*!< 0x00000040 */
#define DCACHE_WMMONR_WMISSMON_7            (0x80UL << DCACHE_WMMONR_WMISSMON_Pos)           /*!< 0x00000080 */
#define DCACHE_WMMONR_WMISSMON_8            (0x100UL << DCACHE_WMMONR_WMISSMON_Pos)          /*!< 0x00000100 */
#define DCACHE_WMMONR_WMISSMON_9            (0x200UL << DCACHE_WMMONR_WMISSMON_Pos)          /*!< 0x00000200 */
#define DCACHE_WMMONR_WMISSMON_10           (0x400UL << DCACHE_WMMONR_WMISSMON_Pos)          /*!< 0x00000400 */
#define DCACHE_WMMONR_WMISSMON_11           (0x800UL << DCACHE_WMMONR_WMISSMON_Pos)          /*!< 0x00000800 */
#define DCACHE_WMMONR_WMISSMON_12           (0x1000UL << DCACHE_WMMONR_WMISSMON_Pos)         /*!< 0x00001000 */
#define DCACHE_WMMONR_WMISSMON_13           (0x2000UL << DCACHE_WMMONR_WMISSMON_Pos)         /*!< 0x00002000 */
#define DCACHE_WMMONR_WMISSMON_14           (0x4000UL << DCACHE_WMMONR_WMISSMON_Pos)         /*!< 0x00004000 */
#define DCACHE_WMMONR_WMISSMON_15           (0x8000UL << DCACHE_WMMONR_WMISSMON_Pos)         /*!< 0x00008000 */

/**************  Bit definition for DCACHE_CMDRSADDRR register  ***************/
#define DCACHE_CMDRSADDRR_CMDSTARTADDR_Pos  (5U)
#define DCACHE_CMDRSADDRR_CMDSTARTADDR_Msk  (0x7FFFFFFUL << DCACHE_CMDRSADDRR_CMDSTARTADDR_Pos)  /*!< 0xFFFFFFE0 */
#define DCACHE_CMDRSADDRR_CMDSTARTADDR      DCACHE_CMDRSADDRR_CMDSTARTADDR_Msk              /*!< start address of range to which the cache maintenance command specified in DCACHE_CR.CACHECMD field applies */

/**************  Bit definition for DCACHE_CMDREADDRR register  ***************/
#define DCACHE_CMDREADDRR_CMDENDADDR_Pos    (5U)
#define DCACHE_CMDREADDRR_CMDENDADDR_Msk    (0x7FFFFFFUL << DCACHE_CMDREADDRR_CMDENDADDR_Pos)/*!< 0xFFFFFFE0 */
#define DCACHE_CMDREADDRR_CMDENDADDR        DCACHE_CMDREADDRR_CMDENDADDR_Msk                /*!< end address of range to which the cache maintenance command specified in DCACHE_CR.CACHECMD field applies */

/****************  Bit definition for DCACHE_HWCFGR register  *****************/
#define DCACHE_HWCFGR_WAYS_Pos              (0U)
#define DCACHE_HWCFGR_WAYS_Msk              (0x3UL << DCACHE_HWCFGR_WAYS_Pos)                /*!< 0x00000003 */
#define DCACHE_HWCFGR_WAYS                  DCACHE_HWCFGR_WAYS_Msk                          /*!< cache associativity, number of ways */
#define DCACHE_HWCFGR_WAYS_0                (0x1UL << DCACHE_HWCFGR_WAYS_Pos)                /*!< 0x00000001 */
#define DCACHE_HWCFGR_WAYS_1                (0x2UL << DCACHE_HWCFGR_WAYS_Pos)                /*!< 0x00000002 */
#define DCACHE_HWCFGR_SIZE_Pos              (4U)
#define DCACHE_HWCFGR_SIZE_Msk              (0x7UL << DCACHE_HWCFGR_SIZE_Pos)                /*!< 0x00000070 */
#define DCACHE_HWCFGR_SIZE                  DCACHE_HWCFGR_SIZE_Msk                          /*!< cache size */
#define DCACHE_HWCFGR_SIZE_0                (0x1UL << DCACHE_HWCFGR_SIZE_Pos)               /*!< 0x00000010 */
#define DCACHE_HWCFGR_SIZE_1                (0x2UL << DCACHE_HWCFGR_SIZE_Pos)               /*!< 0x00000020 */
#define DCACHE_HWCFGR_SIZE_2                (0x4UL << DCACHE_HWCFGR_SIZE_Pos)               /*!< 0x00000040 */
#define DCACHE_HWCFGR_LWIDTH_Pos            (9U)
#define DCACHE_HWCFGR_LWIDTH_Msk            (0x3UL << DCACHE_HWCFGR_LWIDTH_Pos)              /*!< 0x00000600 */
#define DCACHE_HWCFGR_LWIDTH                DCACHE_HWCFGR_LWIDTH_Msk                        /*!< cache line width */
#define DCACHE_HWCFGR_LWIDTH_0              (0x1UL << DCACHE_HWCFGR_LWIDTH_Pos)            /*!< 0x00000200 */
#define DCACHE_HWCFGR_LWIDTH_1              (0x2UL << DCACHE_HWCFGR_LWIDTH_Pos)            /*!< 0x00000400 */
#define DCACHE_HWCFGR_MASTERSIZE_Pos        (23U)
#define DCACHE_HWCFGR_MASTERSIZE_Msk        (0x3UL << DCACHE_HWCFGR_MASTERSIZE_Pos)          /*!< 0x01800000 */
#define DCACHE_HWCFGR_MASTERSIZE            DCACHE_HWCFGR_MASTERSIZE_Msk                    /*!< data size of AHB master interface */
#define DCACHE_HWCFGR_MASTERSIZE_0          (0x1UL << DCACHE_HWCFGR_MASTERSIZE_Pos)     /*!< 0x00800000 */
#define DCACHE_HWCFGR_MASTERSIZE_1          (0x2UL << DCACHE_HWCFGR_MASTERSIZE_Pos)    /*!< 0x01000000 */

/*****************  Bit definition for DCACHE_VERR register  ******************/
#define DCACHE_VERR_MINREV_Pos              (0U)
#define DCACHE_VERR_MINREV_Msk              (0xFUL << DCACHE_VERR_MINREV_Pos)                /*!< 0x0000000F */
#define DCACHE_VERR_MINREV                  DCACHE_VERR_MINREV_Msk                          /*!< minor IP revision */
#define DCACHE_VERR_MINREV_0                (0x1UL << DCACHE_VERR_MINREV_Pos)                /*!< 0x00000001 */
#define DCACHE_VERR_MINREV_1                (0x2UL << DCACHE_VERR_MINREV_Pos)                /*!< 0x00000002 */
#define DCACHE_VERR_MINREV_2                (0x4UL << DCACHE_VERR_MINREV_Pos)                /*!< 0x00000004 */
#define DCACHE_VERR_MINREV_3                (0x8UL << DCACHE_VERR_MINREV_Pos)                /*!< 0x00000008 */
#define DCACHE_VERR_MAJREV_Pos              (4U)
#define DCACHE_VERR_MAJREV_Msk              (0xFUL << DCACHE_VERR_MAJREV_Pos)                /*!< 0x000000F0 */
#define DCACHE_VERR_MAJREV                  DCACHE_VERR_MAJREV_Msk                          /*!< major IP revision */
#define DCACHE_VERR_MAJREV_0                (0x1UL << DCACHE_VERR_MAJREV_Pos)               /*!< 0x00000010 */
#define DCACHE_VERR_MAJREV_1                (0x2UL << DCACHE_VERR_MAJREV_Pos)               /*!< 0x00000020 */
#define DCACHE_VERR_MAJREV_2                (0x4UL << DCACHE_VERR_MAJREV_Pos)               /*!< 0x00000040 */
#define DCACHE_VERR_MAJREV_3                (0x8UL << DCACHE_VERR_MAJREV_Pos)               /*!< 0x00000080 */

/******************************************************************************/
/*                                                                            */
/*                                    DCMI                                    */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DCMI_CR register  ******************/
#define DCMI_CR_CAPTURE_Pos        (0U)
#define DCMI_CR_CAPTURE_Msk        (0x1UL << DCMI_CR_CAPTURE_Pos)              /*!< 0x00000001 */
#define DCMI_CR_CAPTURE            DCMI_CR_CAPTURE_Msk
#define DCMI_CR_CM_Pos             (1U)
#define DCMI_CR_CM_Msk             (0x1UL << DCMI_CR_CM_Pos)                   /*!< 0x00000002 */
#define DCMI_CR_CM                 DCMI_CR_CM_Msk
#define DCMI_CR_CROP_Pos           (2U)
#define DCMI_CR_CROP_Msk           (0x1UL << DCMI_CR_CROP_Pos)                 /*!< 0x00000004 */
#define DCMI_CR_CROP               DCMI_CR_CROP_Msk
#define DCMI_CR_JPEG_Pos           (3U)
#define DCMI_CR_JPEG_Msk           (0x1UL << DCMI_CR_JPEG_Pos)                 /*!< 0x00000008 */
#define DCMI_CR_JPEG               DCMI_CR_JPEG_Msk
#define DCMI_CR_ESS_Pos            (4U)
#define DCMI_CR_ESS_Msk            (0x1UL << DCMI_CR_ESS_Pos)                  /*!< 0x00000010 */
#define DCMI_CR_ESS                DCMI_CR_ESS_Msk
#define DCMI_CR_PCKPOL_Pos         (5U)
#define DCMI_CR_PCKPOL_Msk         (0x1UL << DCMI_CR_PCKPOL_Pos)               /*!< 0x00000020 */
#define DCMI_CR_PCKPOL             DCMI_CR_PCKPOL_Msk
#define DCMI_CR_HSPOL_Pos          (6U)
#define DCMI_CR_HSPOL_Msk          (0x1UL << DCMI_CR_HSPOL_Pos)                /*!< 0x00000040 */
#define DCMI_CR_HSPOL              DCMI_CR_HSPOL_Msk
#define DCMI_CR_VSPOL_Pos          (7U)
#define DCMI_CR_VSPOL_Msk          (0x1UL << DCMI_CR_VSPOL_Pos)                /*!< 0x00000080 */
#define DCMI_CR_VSPOL              DCMI_CR_VSPOL_Msk
#define DCMI_CR_FCRC_0             ((uint32_t)0x00000100U)
#define DCMI_CR_FCRC_1             ((uint32_t)0x00000200U)
#define DCMI_CR_EDM_0              ((uint32_t)0x00000400U)
#define DCMI_CR_EDM_1              ((uint32_t)0x00000800U)
#define DCMI_CR_CRE_Pos            (12U)
#define DCMI_CR_CRE_Msk            (0x1UL << DCMI_CR_CRE_Pos)                  /*!< 0x00001000 */
#define DCMI_CR_CRE                DCMI_CR_CRE_Msk
#define DCMI_CR_ENABLE_Pos         (14U)
#define DCMI_CR_ENABLE_Msk         (0x1UL << DCMI_CR_ENABLE_Pos)               /*!< 0x00004000 */
#define DCMI_CR_ENABLE             DCMI_CR_ENABLE_Msk
#define DCMI_CR_BSM_Pos            (16U)
#define DCMI_CR_BSM_Msk            (0x3UL << DCMI_CR_BSM_Pos)                  /*!< 0x00030000 */
#define DCMI_CR_BSM                DCMI_CR_BSM_Msk
#define DCMI_CR_BSM_0              (0x1UL << DCMI_CR_BSM_Pos)                   /*!< 0x00010000 */
#define DCMI_CR_BSM_1              (0x2UL << DCMI_CR_BSM_Pos)                   /*!< 0x00020000 */
#define DCMI_CR_OEBS_Pos           (18U)
#define DCMI_CR_OEBS_Msk           (0x1UL << DCMI_CR_OEBS_Pos)                 /*!< 0x00040000 */
#define DCMI_CR_OEBS               DCMI_CR_OEBS_Msk
#define DCMI_CR_LSM_Pos            (19U)
#define DCMI_CR_LSM_Msk            (0x1UL << DCMI_CR_LSM_Pos)                  /*!< 0x00080000 */
#define DCMI_CR_LSM                DCMI_CR_LSM_Msk
#define DCMI_CR_OELS_Pos           (20U)
#define DCMI_CR_OELS_Msk           (0x1UL << DCMI_CR_OELS_Pos)                 /*!< 0x00100000 */
#define DCMI_CR_OELS               DCMI_CR_OELS_Msk

/********************  Bits definition for DCMI_SR register  ******************/
#define DCMI_SR_HSYNC_Pos          (0U)
#define DCMI_SR_HSYNC_Msk          (0x1UL << DCMI_SR_HSYNC_Pos)                /*!< 0x00000001 */
#define DCMI_SR_HSYNC              DCMI_SR_HSYNC_Msk
#define DCMI_SR_VSYNC_Pos          (1U)
#define DCMI_SR_VSYNC_Msk          (0x1UL << DCMI_SR_VSYNC_Pos)                /*!< 0x00000002 */
#define DCMI_SR_VSYNC              DCMI_SR_VSYNC_Msk
#define DCMI_SR_FNE_Pos            (2U)
#define DCMI_SR_FNE_Msk            (0x1UL << DCMI_SR_FNE_Pos)                  /*!< 0x00000004 */
#define DCMI_SR_FNE                DCMI_SR_FNE_Msk

/********************  Bits definition for DCMI_RIS register   ****************/
#define DCMI_RIS_FRAME_RIS_Pos     (0U)
#define DCMI_RIS_FRAME_RIS_Msk     (0x1UL << DCMI_RIS_FRAME_RIS_Pos)           /*!< 0x00000001 */
#define DCMI_RIS_FRAME_RIS         DCMI_RIS_FRAME_RIS_Msk
#define DCMI_RIS_OVR_RIS_Pos       (1U)
#define DCMI_RIS_OVR_RIS_Msk       (0x1UL << DCMI_RIS_OVR_RIS_Pos)             /*!< 0x00000002 */
#define DCMI_RIS_OVR_RIS           DCMI_RIS_OVR_RIS_Msk
#define DCMI_RIS_ERR_RIS_Pos       (2U)
#define DCMI_RIS_ERR_RIS_Msk       (0x1UL << DCMI_RIS_ERR_RIS_Pos)             /*!< 0x00000004 */
#define DCMI_RIS_ERR_RIS           DCMI_RIS_ERR_RIS_Msk
#define DCMI_RIS_VSYNC_RIS_Pos     (3U)
#define DCMI_RIS_VSYNC_RIS_Msk     (0x1UL << DCMI_RIS_VSYNC_RIS_Pos)           /*!< 0x00000008 */
#define DCMI_RIS_VSYNC_RIS         DCMI_RIS_VSYNC_RIS_Msk
#define DCMI_RIS_LINE_RIS_Pos      (4U)
#define DCMI_RIS_LINE_RIS_Msk      (0x1UL << DCMI_RIS_LINE_RIS_Pos)            /*!< 0x00000010 */
#define DCMI_RIS_LINE_RIS          DCMI_RIS_LINE_RIS_Msk

/********************  Bits definition for DCMI_IER register  *****************/
#define DCMI_IER_FRAME_IE_Pos      (0U)
#define DCMI_IER_FRAME_IE_Msk      (0x1UL << DCMI_IER_FRAME_IE_Pos)            /*!< 0x00000001 */
#define DCMI_IER_FRAME_IE          DCMI_IER_FRAME_IE_Msk
#define DCMI_IER_OVR_IE_Pos        (1U)
#define DCMI_IER_OVR_IE_Msk        (0x1UL << DCMI_IER_OVR_IE_Pos)              /*!< 0x00000002 */
#define DCMI_IER_OVR_IE            DCMI_IER_OVR_IE_Msk
#define DCMI_IER_ERR_IE_Pos        (2U)
#define DCMI_IER_ERR_IE_Msk        (0x1UL << DCMI_IER_ERR_IE_Pos)              /*!< 0x00000004 */
#define DCMI_IER_ERR_IE            DCMI_IER_ERR_IE_Msk
#define DCMI_IER_VSYNC_IE_Pos      (3U)
#define DCMI_IER_VSYNC_IE_Msk      (0x1UL << DCMI_IER_VSYNC_IE_Pos)            /*!< 0x00000008 */
#define DCMI_IER_VSYNC_IE          DCMI_IER_VSYNC_IE_Msk
#define DCMI_IER_LINE_IE_Pos       (4U)
#define DCMI_IER_LINE_IE_Msk       (0x1UL << DCMI_IER_LINE_IE_Pos)             /*!< 0x00000010 */
#define DCMI_IER_LINE_IE           DCMI_IER_LINE_IE_Msk

/********************  Bits definition for DCMI_MIS register  *****************/
#define DCMI_MIS_FRAME_MIS_Pos     (0U)
#define DCMI_MIS_FRAME_MIS_Msk     (0x1UL << DCMI_MIS_FRAME_MIS_Pos)           /*!< 0x00000001 */
#define DCMI_MIS_FRAME_MIS         DCMI_MIS_FRAME_MIS_Msk
#define DCMI_MIS_OVR_MIS_Pos       (1U)
#define DCMI_MIS_OVR_MIS_Msk       (0x1UL << DCMI_MIS_OVR_MIS_Pos)             /*!< 0x00000002 */
#define DCMI_MIS_OVR_MIS           DCMI_MIS_OVR_MIS_Msk
#define DCMI_MIS_ERR_MIS_Pos       (2U)
#define DCMI_MIS_ERR_MIS_Msk       (0x1UL << DCMI_MIS_ERR_MIS_Pos)             /*!< 0x00000004 */
#define DCMI_MIS_ERR_MIS           DCMI_MIS_ERR_MIS_Msk
#define DCMI_MIS_VSYNC_MIS_Pos     (3U)
#define DCMI_MIS_VSYNC_MIS_Msk     (0x1UL << DCMI_MIS_VSYNC_MIS_Pos)           /*!< 0x00000008 */
#define DCMI_MIS_VSYNC_MIS         DCMI_MIS_VSYNC_MIS_Msk
#define DCMI_MIS_LINE_MIS_Pos      (4U)
#define DCMI_MIS_LINE_MIS_Msk      (0x1UL << DCMI_MIS_LINE_MIS_Pos)            /*!< 0x00000010 */
#define DCMI_MIS_LINE_MIS          DCMI_MIS_LINE_MIS_Msk

/********************  Bits definition for DCMI_ICR register  *****************/
#define DCMI_ICR_FRAME_ISC_Pos     (0U)
#define DCMI_ICR_FRAME_ISC_Msk     (0x1UL << DCMI_ICR_FRAME_ISC_Pos)           /*!< 0x00000001 */
#define DCMI_ICR_FRAME_ISC         DCMI_ICR_FRAME_ISC_Msk
#define DCMI_ICR_OVR_ISC_Pos       (1U)
#define DCMI_ICR_OVR_ISC_Msk       (0x1UL << DCMI_ICR_OVR_ISC_Pos)             /*!< 0x00000002 */
#define DCMI_ICR_OVR_ISC           DCMI_ICR_OVR_ISC_Msk
#define DCMI_ICR_ERR_ISC_Pos       (2U)
#define DCMI_ICR_ERR_ISC_Msk       (0x1UL << DCMI_ICR_ERR_ISC_Pos)             /*!< 0x00000004 */
#define DCMI_ICR_ERR_ISC           DCMI_ICR_ERR_ISC_Msk
#define DCMI_ICR_VSYNC_ISC_Pos     (3U)
#define DCMI_ICR_VSYNC_ISC_Msk     (0x1UL << DCMI_ICR_VSYNC_ISC_Pos)           /*!< 0x00000008 */
#define DCMI_ICR_VSYNC_ISC         DCMI_ICR_VSYNC_ISC_Msk
#define DCMI_ICR_LINE_ISC_Pos      (4U)
#define DCMI_ICR_LINE_ISC_Msk      (0x1UL << DCMI_ICR_LINE_ISC_Pos)            /*!< 0x00000010 */
#define DCMI_ICR_LINE_ISC          DCMI_ICR_LINE_ISC_Msk

