STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_cm33.h
/*****************  Bit definition for DCMIPP_PRFCR register  *****************/
#define DCMIPP_PRFCR_CERRF_Pos              (6U)
#define DCMIPP_PRFCR_CERRF_Msk              (0x1UL << DCMIPP_PRFCR_CERRF_Pos)                /*!< 0x00000040 */
#define DCMIPP_PRFCR_CERRF                  DCMIPP_PRFCR_CERRF_Msk                          /*!< Synchronization error interrupt status clear */

/***************  Bit definition for DCMIPP_CMHWCFGR register  ****************/
#define DCMIPP_CMHWCFGR_CPIPES_Pos          (2U)
#define DCMIPP_CMHWCFGR_CPIPES_Msk          (0x3UL << DCMIPP_CMHWCFGR_CPIPES_Pos)            /*!< 0x0000000C */
#define DCMIPP_CMHWCFGR_CPIPES              DCMIPP_CMHWCFGR_CPIPES_Msk                      /*!< Amount of instantiated pipes (either dump or pixel pipes) */
#define DCMIPP_CMHWCFGR_CPAR_Pos            (4U)
#define DCMIPP_CMHWCFGR_CPAR_Msk            (0x1UL << DCMIPP_CMHWCFGR_CPAR_Pos)              /*!< 0x00000010 */
#define DCMIPP_CMHWCFGR_CPAR                DCMIPP_CMHWCFGR_CPAR_Msk                        /*!< Presence of the parallel interface */
#define DCMIPP_CMHWCFGR_CCSI_Pos            (5U)
#define DCMIPP_CMHWCFGR_CCSI_Msk            (0x1UL << DCMIPP_CMHWCFGR_CCSI_Pos)              /*!< 0x00000020 */
#define DCMIPP_CMHWCFGR_CCSI                DCMIPP_CMHWCFGR_CCSI_Msk                        /*!< Presence of the CSI-2 host interface */
#define DCMIPP_CMHWCFGR_TPG_Pos             (6U)
#define DCMIPP_CMHWCFGR_TPG_Msk             (0x1UL << DCMIPP_CMHWCFGR_TPG_Pos)               /*!< 0x00000040 */
#define DCMIPP_CMHWCFGR_TPG                 DCMIPP_CMHWCFGR_TPG_Msk                         /*!< Presence of the test pattern generator */

/*****************  Bit definition for DCMIPP_CMCR register  ******************/
#define DCMIPP_CMCR_INSEL_Pos               (0U)
#define DCMIPP_CMCR_INSEL_Msk               (0x1UL << DCMIPP_CMCR_INSEL_Pos)                 /*!< 0x00000001 */
#define DCMIPP_CMCR_INSEL                   DCMIPP_CMCR_INSEL_Msk                           /*!< input selection */
#define DCMIPP_CMCR_PSFC_Pos                (1U)
#define DCMIPP_CMCR_PSFC_Msk                (0x3UL << DCMIPP_CMCR_PSFC_Pos)                  /*!< 0x00000006 */
#define DCMIPP_CMCR_PSFC                    DCMIPP_CMCR_PSFC_Msk                            /*!< Pipe selection for the frame counter */
#define DCMIPP_CMCR_CFC_Pos                 (4U)
#define DCMIPP_CMCR_CFC_Msk                 (0x1UL << DCMIPP_CMCR_CFC_Pos)                   /*!< 0x00000010 */
#define DCMIPP_CMCR_CFC                     DCMIPP_CMCR_CFC_Msk                             /*!< Clear frame counter */
#define DCMIPP_CMCR_SWAPRB_Pos              (7U)
#define DCMIPP_CMCR_SWAPRB_Msk              (0x1UL << DCMIPP_CMCR_SWAPRB_Pos)                /*!< 0x00000080 */
#define DCMIPP_CMCR_SWAPRB                  DCMIPP_CMCR_SWAPRB_Msk                          /*!< Swap R/U and B/V */

/****************  Bit definition for DCMIPP_CMFRCR register  *****************/
#define DCMIPP_CMFRCR_FRMCNT_Pos            (0U)
#define DCMIPP_CMFRCR_FRMCNT_Msk            (0xFFFFFFFFUL << DCMIPP_CMFRCR_FRMCNT_Pos)       /*!< 0xFFFFFFFF */
#define DCMIPP_CMFRCR_FRMCNT                DCMIPP_CMFRCR_FRMCNT_Msk                        /*!< Frame counter, read-only, loops around */

/***************  Bit definition for DCMIPP_CMTPGCR1 register  ****************/
#define DCMIPP_CMTPGCR1_WIDTH_Pos           (0U)
#define DCMIPP_CMTPGCR1_WIDTH_Msk           (0x3FFFUL << DCMIPP_CMTPGCR1_WIDTH_Pos)          /*!< 0x00003FFF */
#define DCMIPP_CMTPGCR1_WIDTH               DCMIPP_CMTPGCR1_WIDTH_Msk                       /*!< Width of the visible pixels of the generated frame */
#define DCMIPP_CMTPGCR1_HEIGHT_Pos          (16U)
#define DCMIPP_CMTPGCR1_HEIGHT_Msk          (0x3FFFUL << DCMIPP_CMTPGCR1_HEIGHT_Pos)         /*!< 0x3FFF0000 */
#define DCMIPP_CMTPGCR1_HEIGHT              DCMIPP_CMTPGCR1_HEIGHT_Msk                      /*!< Height of the visible pixels of the generated frame */

/***************  Bit definition for DCMIPP_CMTPGCR2 register  ****************/
#define DCMIPP_CMTPGCR2_TPGEN_Pos           (0U)
#define DCMIPP_CMTPGCR2_TPGEN_Msk           (0x1UL << DCMIPP_CMTPGCR2_TPGEN_Pos)             /*!< 0x00000001 */
#define DCMIPP_CMTPGCR2_TPGEN               DCMIPP_CMTPGCR2_TPGEN_Msk                       /*!< Test pattern generator enable */
#define DCMIPP_CMTPGCR2_LFLEN_Pos           (1U)
#define DCMIPP_CMTPGCR2_LFLEN_Msk           (0x1UL << DCMIPP_CMTPGCR2_LFLEN_Pos)             /*!< 0x00000002 */
#define DCMIPP_CMTPGCR2_LFLEN               DCMIPP_CMTPGCR2_LFLEN_Msk                       /*!< Lifeline enable */
#define DCMIPP_CMTPGCR2_GSEN_Pos            (2U)
#define DCMIPP_CMTPGCR2_GSEN_Msk            (0x1UL << DCMIPP_CMTPGCR2_GSEN_Pos)              /*!< 0x00000004 */
#define DCMIPP_CMTPGCR2_GSEN                DCMIPP_CMTPGCR2_GSEN_Msk                        /*!< Gray scale enable */
#define DCMIPP_CMTPGCR2_PATTERN_Pos         (3U)
#define DCMIPP_CMTPGCR2_PATTERN_Msk         (0x1UL << DCMIPP_CMTPGCR2_PATTERN_Pos)           /*!< 0x00000008 */
#define DCMIPP_CMTPGCR2_PATTERN             DCMIPP_CMTPGCR2_PATTERN_Msk                     /*!< Pattern selection, between color bars and color squares */
#define DCMIPP_CMTPGCR2_YT_Pos              (4U)
#define DCMIPP_CMTPGCR2_YT_Msk              (0x3UL << DCMIPP_CMTPGCR2_YT_Pos)                /*!< 0x00000030 */
#define DCMIPP_CMTPGCR2_YT                  DCMIPP_CMTPGCR2_YT_Msk                          /*!< YUV type */
#define DCMIPP_CMTPGCR2_RT_Pos              (6U)
#define DCMIPP_CMTPGCR2_RT_Msk              (0x3UL << DCMIPP_CMTPGCR2_RT_Pos)                /*!< 0x000000C0 */
#define DCMIPP_CMTPGCR2_RT                  DCMIPP_CMTPGCR2_RT_Msk                          /*!< Raw Bayer type */
#define DCMIPP_CMTPGCR2_FORMAT_Pos          (8U)
#define DCMIPP_CMTPGCR2_FORMAT_Msk          (0xFFUL << DCMIPP_CMTPGCR2_FORMAT_Pos)           /*!< 0x0000FF00 */
#define DCMIPP_CMTPGCR2_FORMAT              DCMIPP_CMTPGCR2_FORMAT_Msk                      /*!< Pixel format generated: */
#define DCMIPP_CMTPGCR2_VBL_Pos             (16U)
#define DCMIPP_CMTPGCR2_VBL_Msk             (0xFFFFUL << DCMIPP_CMTPGCR2_VBL_Pos)            /*!< 0xFFFF0000 */
#define DCMIPP_CMTPGCR2_VBL                 DCMIPP_CMTPGCR2_VBL_Msk                         /*!< Amount of lines of the vertical blanking */

