STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_cm33.h
/******************  Bit definition for EXTI2_SWIER2 register  ******************/
#define EXTI2_SWIER2_SWI46_Pos    (14U)
#define EXTI2_SWIER2_SWI46_Msk    (0x1UL << EXTI2_SWIER2_SWI46_Pos)           /*!< 0x00004000 */
#define EXTI2_SWIER2_SWI46        EXTI2_SWIER2_SWI46_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI47_Pos    (15U)
#define EXTI2_SWIER2_SWI47_Msk    (0x1UL << EXTI2_SWIER2_SWI47_Pos)           /*!< 0x00008000 */
#define EXTI2_SWIER2_SWI47        EXTI2_SWIER2_SWI47_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI48_Pos    (16U)
#define EXTI2_SWIER2_SWI48_Msk    (0x1UL << EXTI2_SWIER2_SWI48_Pos)           /*!< 0x00010000 */
#define EXTI2_SWIER2_SWI48        EXTI2_SWIER2_SWI48_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI49_Pos    (17U)
#define EXTI2_SWIER2_SWI49_Msk    (0x1UL << EXTI2_SWIER2_SWI49_Pos)           /*!< 0x00020000 */
#define EXTI2_SWIER2_SWI49        EXTI2_SWIER2_SWI49_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI50_Pos    (18U)
#define EXTI2_SWIER2_SWI50_Msk    (0x1UL << EXTI2_SWIER2_SWI50_Pos)           /*!< 0x00040000 */
#define EXTI2_SWIER2_SWI50        EXTI2_SWIER2_SWI50_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI51_Pos    (19U)
#define EXTI2_SWIER2_SWI51_Msk    (0x1UL << EXTI2_SWIER2_SWI51_Pos)           /*!< 0x00080000 */
#define EXTI2_SWIER2_SWI51        EXTI2_SWIER2_SWI51_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI59_Pos    (27U)
#define EXTI2_SWIER2_SWI59_Msk    (0x1UL << EXTI2_SWIER2_SWI59_Pos)           /*!< 0x08000000 */
#define EXTI2_SWIER2_SWI59        EXTI2_SWIER2_SWI59_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI60_Pos    (28U)
#define EXTI2_SWIER2_SWI60_Msk    (0x1UL << EXTI2_SWIER2_SWI60_Pos)           /*!< 0x10000000 */
#define EXTI2_SWIER2_SWI60        EXTI2_SWIER2_SWI60_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI2_SWIER2_SWI61_Pos    (29U)
#define EXTI2_SWIER2_SWI61_Msk    (0x1UL << EXTI2_SWIER2_SWI61_Pos)           /*!< 0x20000000 */
#define EXTI2_SWIER2_SWI61        EXTI2_SWIER2_SWI61_Msk                     /*!< Software Interrupt on line 49 */

/******************  Bit definition for EXTI2_RPR2 register  *******************/
#define EXTI2_RPR2_RPIF46_Pos        (14U)
#define EXTI2_RPR2_RPIF46_Msk        (0x1UL << EXTI2_RPR2_RPIF46_Pos)               /*!< 0x00004000 */
#define EXTI2_RPR2_RPIF46            EXTI2_RPR2_RPIF46_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF47_Pos        (15U)
#define EXTI2_RPR2_RPIF47_Msk        (0x1UL << EXTI2_RPR2_RPIF47_Pos)               /*!< 0x00008000 */
#define EXTI2_RPR2_RPIF47            EXTI2_RPR2_RPIF47_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF48_Pos        (16U)
#define EXTI2_RPR2_RPIF48_Msk        (0x1UL << EXTI2_RPR2_RPIF48_Pos)               /*!< 0x00010000 */
#define EXTI2_RPR2_RPIF48            EXTI2_RPR2_RPIF48_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF49_Pos        (17U)
#define EXTI2_RPR2_RPIF49_Msk        (0x1UL << EXTI2_RPR2_RPIF49_Pos)               /*!< 0x00020000 */
#define EXTI2_RPR2_RPIF49            EXTI2_RPR2_RPIF49_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF50_Pos        (18U)
#define EXTI2_RPR2_RPIF50_Msk        (0x1UL << EXTI2_RPR2_RPIF50_Pos)               /*!< 0x00040000 */
#define EXTI2_RPR2_RPIF50            EXTI2_RPR2_RPIF50_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF51_Pos        (19U)
#define EXTI2_RPR2_RPIF51_Msk        (0x1UL << EXTI2_RPR2_RPIF51_Pos)               /*!< 0x00080000 */
#define EXTI2_RPR2_RPIF51            EXTI2_RPR2_RPIF51_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI2_RPR2_RPIF59_Pos        (27U)
#define EXTI2_RPR2_RPIF59_Msk        (0x1UL << EXTI2_RPR2_RPIF59_Pos)               /*!< 0x08000000 */
#define EXTI2_RPR2_RPIF59            EXTI2_RPR2_RPIF59_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF60_Pos        (28U)
#define EXTI2_RPR2_RPIF60_Msk        (0x1UL << EXTI2_RPR2_RPIF60_Pos)               /*!< 0x10000000 */
#define EXTI2_RPR2_RPIF60            EXTI2_RPR2_RPIF60_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RPR2_RPIF61_Pos        (29U)
#define EXTI2_RPR2_RPIF61_Msk        (0x1UL << EXTI2_RPR2_RPIF61_Pos)               /*!< 0x20000000 */
#define EXTI2_RPR2_RPIF61            EXTI2_RPR2_RPIF61_Msk                         /*!< Rising trigger event configuration bit of line 49 */

/******************  Bit definition for EXTI2_FPR2 register  *******************/
#define EXTI2_FPR2_FPIF46_Pos        (14U)
#define EXTI2_FPR2_FPIF46_Msk        (0x1UL << EXTI2_FPR2_FPIF46_Pos)               /*!< 0x00004000 */
#define EXTI2_FPR2_FPIF46            EXTI2_FPR2_FPIF46_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF47_Pos        (15U)
#define EXTI2_FPR2_FPIF47_Msk        (0x1UL << EXTI2_FPR2_FPIF47_Pos)               /*!< 0x00008000 */
#define EXTI2_FPR2_FPIF47            EXTI2_FPR2_FPIF47_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF48_Pos        (16U)
#define EXTI2_FPR2_FPIF48_Msk        (0x1UL << EXTI2_FPR2_FPIF48_Pos)               /*!< 0x00010000 */
#define EXTI2_FPR2_FPIF48            EXTI2_FPR2_FPIF48_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF49_Pos        (17U)
#define EXTI2_FPR2_FPIF49_Msk        (0x1UL << EXTI2_FPR2_FPIF49_Pos)               /*!< 0x00020000 */
#define EXTI2_FPR2_FPIF49            EXTI2_FPR2_FPIF49_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF50_Pos        (18U)
#define EXTI2_FPR2_FPIF50_Msk        (0x1UL << EXTI2_FPR2_FPIF50_Pos)               /*!< 0x00040000 */
#define EXTI2_FPR2_FPIF50            EXTI2_FPR2_FPIF50_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF51_Pos        (19U)
#define EXTI2_FPR2_FPIF51_Msk        (0x1UL << EXTI2_FPR2_FPIF51_Pos)               /*!< 0x00080000 */
#define EXTI2_FPR2_FPIF51            EXTI2_FPR2_FPIF51_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI2_FPR2_FPIF59_Pos        (27U)
#define EXTI2_FPR2_FPIF59_Msk        (0x1UL << EXTI2_FPR2_FPIF59_Pos)               /*!< 0x08000000 */
#define EXTI2_FPR2_FPIF59            EXTI2_FPR2_FPIF59_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF60_Pos        (28U)
#define EXTI2_FPR2_FPIF60_Msk        (0x1UL << EXTI2_FPR2_FPIF60_Pos)               /*!< 0x10000000 */
#define EXTI2_FPR2_FPIF60            EXTI2_FPR2_FPIF60_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FPR2_FPIF61_Pos        (29U)
#define EXTI2_FPR2_FPIF61_Msk        (0x1UL << EXTI2_FPR2_FPIF61_Pos)               /*!< 0x20000000 */
#define EXTI2_FPR2_FPIF61            EXTI2_FPR2_FPIF61_Msk                         /*!< Rising trigger event configuration bit of line 49 */

/******************  Bit definition for EXTI2_SECCFGR2  register  ******************/
/* no event input 32  */
#define EXTI2_SECCFGR2_SEC33_Pos  (1U)
#define EXTI2_SECCFGR2_SEC33_Msk  (0x1UL << EXTI2_SECCFGR2_SEC33_Pos)          /*!< 0x00000002 */
#define EXTI2_SECCFGR2_SEC33      EXTI2_SECCFGR2_SEC33_Msk                    /*!< SEC/PRIV enable on event input 33 */
#define EXTI2_SECCFGR2_SEC34_Pos  (2U)
#define EXTI2_SECCFGR2_SEC34_Msk  (0x1UL << EXTI2_SECCFGR2_SEC34_Pos)          /*!< 0x00000004 */
#define EXTI2_SECCFGR2_SEC34      EXTI2_SECCFGR2_SEC34_Msk                    /*!< SEC/PRIV enable on event input 34 */
#define EXTI2_SECCFGR2_SEC35_Pos  (3U)
#define EXTI2_SECCFGR2_SEC35_Msk  (0x1UL << EXTI2_SECCFGR2_SEC35_Pos)          /*!< 0x00000008 */
#define EXTI2_SECCFGR2_SEC35      EXTI2_SECCFGR2_SEC35_Msk                    /*!< SEC/PRIV enable on event input 3( */
#define EXTI2_SECCFGR2_SEC36_Pos  (4U)
#define EXTI2_SECCFGR2_SEC36_Msk  (0x1UL << EXTI2_SECCFGR2_SEC36_Pos)          /*!< 0x00000010 */
#define EXTI2_SECCFGR2_SEC36      EXTI2_SECCFGR2_SEC36_Msk                    /*!< SEC/PRIV enable on event input 36 */
#define EXTI2_SECCFGR2_SEC37_Pos  (5U)
#define EXTI2_SECCFGR2_SEC37_Msk  (0x1UL << EXTI2_SECCFGR2_SEC37_Pos)          /*!< 0x00000020 */
#define EXTI2_SECCFGR2_SEC37      EXTI2_SECCFGR2_SEC37_Msk                    /*!< SEC/PRIV enable on event input 37 */
#define EXTI2_SECCFGR2_SEC38_Pos  (6U)
#define EXTI2_SECCFGR2_SEC38_Msk  (0x1UL << EXTI2_SECCFGR2_SEC38_Pos)          /*!< 0x00000040 */
#define EXTI2_SECCFGR2_SEC38      EXTI2_SECCFGR2_SEC38_Msk                    /*!< SEC/PRIV enable on event input 38 */
/* no event input 39  */
#define EXTI2_SECCFGR2_SEC40_Pos  (8U)
#define EXTI2_SECCFGR2_SEC40_Msk  (0x1UL << EXTI2_SECCFGR2_SEC40_Pos)          /*!< 0x00000100 */
#define EXTI2_SECCFGR2_SEC40      EXTI2_SECCFGR2_SEC40_Msk                    /*!< SEC/PRIV enable on event input 40 */
#define EXTI2_SECCFGR2_SEC41_Pos  (9U)
#define EXTI2_SECCFGR2_SEC41_Msk  (0x1UL << EXTI2_SECCFGR2_SEC41_Pos)          /*!< 0x00000200 */
#define EXTI2_SECCFGR2_SEC41      EXTI2_SECCFGR2_SEC41_Msk                    /*!< SEC/PRIV enable on event input 41 */
#define EXTI2_SECCFGR2_SEC42_Pos  (10U)
#define EXTI2_SECCFGR2_SEC42_Msk  (0x1UL << EXTI2_SECCFGR2_SEC42_Pos)         /*!< 0x00000400 */
#define EXTI2_SECCFGR2_SEC42      EXTI2_SECCFGR2_SEC42_Msk                   /*!< SEC/PRIV enable on event input 42 */
#define EXTI2_SECCFGR2_SEC43_Pos  (11U)
#define EXTI2_SECCFGR2_SEC43_Msk  (0x1UL << EXTI2_SECCFGR2_SEC43_Pos)         /*!< 0x00000800 */
#define EXTI2_SECCFGR2_SEC43      EXTI2_SECCFGR2_SEC43_Msk                   /*!< SEC/PRIV enable on event input 43 */
#define EXTI2_SECCFGR2_SEC44_Pos  (12U)
#define EXTI2_SECCFGR2_SEC44_Msk  (0x1UL << EXTI2_SECCFGR2_SEC44_Pos)         /*!< 0x00001000 */
#define EXTI2_SECCFGR2_SEC44      EXTI2_SECCFGR2_SEC44_Msk                   /*!< SEC/PRIV enable on event input 45 */
/* no event input 45  */
#define EXTI2_SECCFGR2_SEC46_Pos  (14U)
#define EXTI2_SECCFGR2_SEC46_Msk  (0x1UL << EXTI2_SECCFGR2_SEC46_Pos)         /*!< 0x00004000 */
#define EXTI2_SECCFGR2_SEC46      EXTI2_SECCFGR2_SEC46_Msk                   /*!< SEC/PRIV enable on event input 46 */
#define EXTI2_SECCFGR2_SEC47_Pos  (15U)
#define EXTI2_SECCFGR2_SEC47_Msk   (0x1UL << EXTI2_SECCFGR2_SEC47_Pos)         /*!< 0x00008000 */
#define EXTI2_SECCFGR2_SEC47      EXTI2_SECCFGR2_SEC47_Msk                   /*!< SEC/PRIV enable on event input 47 */
#define EXTI2_SECCFGR2_SEC48_Pos  (16U)
#define EXTI2_SECCFGR2_SEC48_Msk  (0x1UL << EXTI2_SECCFGR2_SEC48_Pos)         /*!< 0x00010000 */
#define EXTI2_SECCFGR2_SEC48      EXTI2_SECCFGR2_SEC48_Msk                   /*!< SEC/PRIV enable on event input 48 */
#define EXTI2_SECCFGR2_SEC49_Pos  (17U)
#define EXTI2_SECCFGR2_SEC49_Msk  (0x1UL << EXTI2_SECCFGR2_SEC49_Pos)         /*!< 0x00020000 */
#define EXTI2_SECCFGR2_SEC49      EXTI2_SECCFGR2_SEC49_Msk                   /*!< SEC/PRIV enable on event input 49 */
#define EXTI2_SECCFGR2_SEC50_Pos  (18U)
#define EXTI2_SECCFGR2_SEC50_Msk  (0x1UL << EXTI2_SECCFGR2_SEC50_Pos)         /*!< 0x00040000 */
#define EXTI2_SECCFGR2_SEC50      EXTI2_SECCFGR2_SEC50_Msk                   /*!< SEC/PRIV enable on event input 50 */
#define EXTI2_SECCFGR2_SEC51_Pos  (19U)
#define EXTI2_SECCFGR2_SEC51_Msk  (0x1UL << EXTI2_SECCFGR2_SEC51_Pos)         /*!< 0x00080000 */
#define EXTI2_SECCFGR2_SEC51      EXTI2_SECCFGR2_SEC51_Msk                   /*!< SEC/PRIV enable on event input 50 */
#define EXTI2_SECCFGR2_SEC52_Pos  (20U)
#define EXTI2_SECCFGR2_SEC52_Msk  (0x1UL << EXTI2_SECCFGR2_SEC52_Pos)         /*!< 0x00100000 */
#define EXTI2_SECCFGR2_SEC52      EXTI2_SECCFGR2_SEC52_Msk                   /*!< SEC/PRIV enable on event input 52 */
#define EXTI2_SECCFGR2_SEC53_Pos  (21U)
#define EXTI2_SECCFGR2_SEC53_Msk  (0x1UL << EXTI2_SECCFGR2_SEC53_Pos)         /*!< 0x00200000 */
#define EXTI2_SECCFGR2_SEC53      EXTI2_SECCFGR2_SEC53_Msk                   /*!< SEC/PRIV enable on event input 53 */
#define EXTI2_SECCFGR2_SEC54_Pos  (22U)
#define EXTI2_SECCFGR2_SEC54_Msk  (0x1UL << EXTI2_SECCFGR2_SEC54_Pos)         /*!< 0x00400000 */
#define EXTI2_SECCFGR2_SEC54      EXTI2_SECCFGR2_SEC54_Msk                   /*!< SEC/PRIV enable on event input 54 */
#define EXTI2_SECCFGR2_SEC55_Pos  (23U)
#define EXTI2_SECCFGR2_SEC55_Msk  (0x1UL << EXTI2_SECCFGR2_SEC55_Pos)         /*!< 0x00800000 */
#define EXTI2_SECCFGR2_SEC55      EXTI2_SECCFGR2_SEC55_Msk                   /*!< SEC/PRIV enable on event input 55 */
#define EXTI2_SECCFGR2_SEC56_Pos  (24U)
#define EXTI2_SECCFGR2_SEC56_Msk  (0x1UL << EXTI2_SECCFGR2_SEC56_Pos)         /*!< 0x01000000 */
#define EXTI2_SECCFGR2_SEC56      EXTI2_SECCFGR2_SEC56_Msk                   /*!< SEC/PRIV enable on event input 56 */
/* no event input 57  */
/* no event input 58  */
#define EXTI2_SECCFGR2_SEC59_Pos  (27U)
#define EXTI2_SECCFGR2_SEC59_Msk  (0x1UL << EXTI2_SECCFGR2_SEC59_Pos)         /*!< 0x08000000 */
#define EXTI2_SECCFGR2_SEC59      EXTI2_SECCFGR2_SEC59_Msk                   /*!< SEC/PRIV enable on event input 59 */
#define EXTI2_SECCFGR2_SEC60_Pos  (28U)
#define EXTI2_SECCFGR2_SEC60_Msk  (0x1UL << EXTI2_SECCFGR2_SEC60_Pos)         /*!< 0x10000000 */
#define EXTI2_SECCFGR2_SEC60      EXTI2_SECCFGR2_SEC60_Msk                   /*!< SEC/PRIV enable on event input 60 */
#define EXTI2_SECCFGR2_SEC61_Pos  (29U)
#define EXTI2_SECCFGR2_SEC61_Msk  (0x1UL << EXTI2_SECCFGR2_SEC61_Pos)         /*!< 0x20000000 */
#define EXTI2_SECCFGR2_SEC61      EXTI2_SECCFGR2_SEC61_Msk                   /*!< SEC/PRIV enable on event input 61 */
#define EXTI2_SECCFGR2_SEC62_Pos  (30U)
#define EXTI2_SECCFGR2_SEC62_Msk  (0x1UL << EXTI2_SECCFGR2_SEC62_Pos)         /*!< 0x40000000 */
#define EXTI2_SECCFGR2_SEC62      EXTI2_SECCFGR2_SEC62_Msk                   /*!< SEC/PRIV enable on event input 62 */
#define EXTI2_SECCFGR2_SEC63_Pos  (31U)
#define EXTI2_SECCFGR2_SEC63_Msk  (0x1UL << EXTI2_SECCFGR2_SEC63_Pos)         /*!< 0x80000000 */
#define EXTI2_SECCFGR2_SEC63      EXTI2_SECCFGR2_SEC63_Msk                   /*!< SEC/PRIV enable on event input 63 */

/******************  Bit definition for EXTI2_PRIVCFGR2 register  ******************/
/* no event input 32  */
#define EXTI2_PRIVCFGR2_PRIV33_Pos  (1U)
#define EXTI2_PRIVCFGR2_PRIV33_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV33_Pos)          /*!< 0x00000002 */
#define EXTI2_PRIVCFGR2_PRIV33      EXTI2_PRIVCFGR2_PRIV33_Msk                    /*!< SEC/PRIV enable on event input 33 */
#define EXTI2_PRIVCFGR2_PRIV34_Pos  (2U)
#define EXTI2_PRIVCFGR2_PRIV34_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV34_Pos)          /*!< 0x00000004 */
#define EXTI2_PRIVCFGR2_PRIV34      EXTI2_PRIVCFGR2_PRIV34_Msk                    /*!< SEC/PRIV enable on event input 34 */
#define EXTI2_PRIVCFGR2_PRIV35_Pos  (3U)
#define EXTI2_PRIVCFGR2_PRIV35_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV35_Pos)          /*!< 0x00000008 */
#define EXTI2_PRIVCFGR2_PRIV35      EXTI2_PRIVCFGR2_PRIV35_Msk                    /*!< SEC/PRIV enable on event input 3( */
#define EXTI2_PRIVCFGR2_PRIV36_Pos  (4U)
#define EXTI2_PRIVCFGR2_PRIV36_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV36_Pos)          /*!< 0x00000010 */
#define EXTI2_PRIVCFGR2_PRIV36      EXTI2_PRIVCFGR2_PRIV36_Msk                    /*!< SEC/PRIV enable on event input 36 */
#define EXTI2_PRIVCFGR2_PRIV37_Pos  (5U)
#define EXTI2_PRIVCFGR2_PRIV37_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV37_Pos)          /*!< 0x00000020 */
#define EXTI2_PRIVCFGR2_PRIV37      EXTI2_PRIVCFGR2_PRIV37_Msk                    /*!< SEC/PRIV enable on event input 37 */
#define EXTI2_PRIVCFGR2_PRIV38_Pos  (6U)
#define EXTI2_PRIVCFGR2_PRIV38_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV38_Pos)          /*!< 0x00000040 */
#define EXTI2_PRIVCFGR2_PRIV38      EXTI2_PRIVCFGR2_PRIV38_Msk                    /*!< SEC/PRIV enable on event input 38 */
/* no event input 39  */
#define EXTI2_PRIVCFGR2_PRIV40_Pos  (8U)
#define EXTI2_PRIVCFGR2_PRIV40_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV40_Pos)          /*!< 0x00000100 */
#define EXTI2_PRIVCFGR2_PRIV40      EXTI2_PRIVCFGR2_PRIV40_Msk                    /*!< SEC/PRIV enable on event input 40 */
#define EXTI2_PRIVCFGR2_PRIV41_Pos  (9U)
#define EXTI2_PRIVCFGR2_PRIV41_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV41_Pos)          /*!< 0x00000200 */
#define EXTI2_PRIVCFGR2_PRIV41      EXTI2_PRIVCFGR2_PRIV41_Msk                    /*!< SEC/PRIV enable on event input 41 */
#define EXTI2_PRIVCFGR2_PRIV42_Pos  (10U)
#define EXTI2_PRIVCFGR2_PRIV42_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV42_Pos)         /*!< 0x00000400 */
#define EXTI2_PRIVCFGR2_PRIV42      EXTI2_PRIVCFGR2_PRIV42_Msk                   /*!< SEC/PRIV enable on event input 42 */
#define EXTI2_PRIVCFGR2_PRIV43_Pos  (11U)
#define EXTI2_PRIVCFGR2_PRIV43_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV43_Pos)         /*!< 0x00000800 */
#define EXTI2_PRIVCFGR2_PRIV43      EXTI2_PRIVCFGR2_PRIV43_Msk                   /*!< SEC/PRIV enable on event input 43 */
#define EXTI2_PRIVCFGR2_PRIV44_Pos  (12U)
#define EXTI2_PRIVCFGR2_PRIV44_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV44_Pos)         /*!< 0x00001000 */
#define EXTI2_PRIVCFGR2_PRIV44      EXTI2_PRIVCFGR2_PRIV44_Msk                   /*!< SEC/PRIV enable on event input 45 */
/* no event input 45  */
#define EXTI2_PRIVCFGR2_PRIV46_Pos  (14U)
#define EXTI2_PRIVCFGR2_PRIV46_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV46_Pos)         /*!< 0x00004000 */
#define EXTI2_PRIVCFGR2_PRIV46      EXTI2_PRIVCFGR2_PRIV46_Msk                   /*!< SEC/PRIV enable on event input 46 */
#define EXTI2_PRIVCFGR2_PRIV47_Pos  (15U)
#define EXTI2_PRIVCFGR2_PRIV47_Msk   (0x1UL << EXTI2_PRIVCFGR2_PRIV47_Pos)         /*!< 0x00008000 */
#define EXTI2_PRIVCFGR2_PRIV47      EXTI2_PRIVCFGR2_PRIV47_Msk                   /*!< SEC/PRIV enable on event input 47 */
#define EXTI2_PRIVCFGR2_PRIV48_Pos  (16U)
#define EXTI2_PRIVCFGR2_PRIV48_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV48_Pos)         /*!< 0x00010000 */
#define EXTI2_PRIVCFGR2_PRIV48      EXTI2_PRIVCFGR2_PRIV48_Msk                   /*!< SEC/PRIV enable on event input 48 */
#define EXTI2_PRIVCFGR2_PRIV49_Pos  (17U)
#define EXTI2_PRIVCFGR2_PRIV49_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV49_Pos)         /*!< 0x00020000 */
#define EXTI2_PRIVCFGR2_PRIV49      EXTI2_PRIVCFGR2_PRIV49_Msk                   /*!< SEC/PRIV enable on event input 49 */
#define EXTI2_PRIVCFGR2_PRIV50_Pos  (18U)
#define EXTI2_PRIVCFGR2_PRIV50_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV50_Pos)         /*!< 0x00040000 */
#define EXTI2_PRIVCFGR2_PRIV50      EXTI2_PRIVCFGR2_PRIV50_Msk                   /*!< SEC/PRIV enable on event input 50 */
#define EXTI2_PRIVCFGR2_PRIV51_Pos  (19U)
#define EXTI2_PRIVCFGR2_PRIV51_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV51_Pos)         /*!< 0x00080000 */
#define EXTI2_PRIVCFGR2_PRIV51      EXTI2_PRIVCFGR2_PRIV51_Msk                   /*!< SEC/PRIV enable on event input 50 */
#define EXTI2_PRIVCFGR2_PRIV52_Pos  (20U)
#define EXTI2_PRIVCFGR2_PRIV52_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV52_Pos)         /*!< 0x00100000 */
#define EXTI2_PRIVCFGR2_PRIV52      EXTI2_PRIVCFGR2_PRIV52_Msk                   /*!< SEC/PRIV enable on event input 52 */
#define EXTI2_PRIVCFGR2_PRIV53_Pos  (21U)
#define EXTI2_PRIVCFGR2_PRIV53_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV53_Pos)         /*!< 0x00200000 */
#define EXTI2_PRIVCFGR2_PRIV53      EXTI2_PRIVCFGR2_PRIV53_Msk                   /*!< SEC/PRIV enable on event input 53 */
#define EXTI2_PRIVCFGR2_PRIV54_Pos  (22U)
#define EXTI2_PRIVCFGR2_PRIV54_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV54_Pos)         /*!< 0x00400000 */
#define EXTI2_PRIVCFGR2_PRIV54      EXTI2_PRIVCFGR2_PRIV54_Msk                   /*!< SEC/PRIV enable on event input 54 */
#define EXTI2_PRIVCFGR2_PRIV55_Pos  (23U)
#define EXTI2_PRIVCFGR2_PRIV55_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV55_Pos)         /*!< 0x00800000 */
#define EXTI2_PRIVCFGR2_PRIV55      EXTI2_PRIVCFGR2_PRIV55_Msk                   /*!< SEC/PRIV enable on event input 55 */
#define EXTI2_PRIVCFGR2_PRIV56_Pos  (24U)
#define EXTI2_PRIVCFGR2_PRIV56_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV56_Pos)         /*!< 0x01000000 */
#define EXTI2_PRIVCFGR2_PRIV56      EXTI2_PRIVCFGR2_PRIV56_Msk                   /*!< SEC/PRIV enable on event input 56 */
/* no event input 57  */
/* no event input 58  */
#define EXTI2_PRIVCFGR2_PRIV59_Pos  (27U)
#define EXTI2_PRIVCFGR2_PRIV59_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV59_Pos)         /*!< 0x08000000 */
#define EXTI2_PRIVCFGR2_PRIV59      EXTI2_PRIVCFGR2_PRIV59_Msk                   /*!< SEC/PRIV enable on event input 59 */
#define EXTI2_PRIVCFGR2_PRIV60_Pos  (28U)
#define EXTI2_PRIVCFGR2_PRIV60_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV60_Pos)         /*!< 0x10000000 */
#define EXTI2_PRIVCFGR2_PRIV60      EXTI2_PRIVCFGR2_PRIV60_Msk                   /*!< SEC/PRIV enable on event input 60 */
#define EXTI2_PRIVCFGR2_PRIV61_Pos  (29U)
#define EXTI2_PRIVCFGR2_PRIV61_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV61_Pos)         /*!< 0x20000000 */
#define EXTI2_PRIVCFGR2_PRIV61      EXTI2_PRIVCFGR2_PRIV61_Msk                   /*!< SEC/PRIV enable on event input 61 */
#define EXTI2_PRIVCFGR2_PRIV62_Pos  (30U)
#define EXTI2_PRIVCFGR2_PRIV62_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV62_Pos)         /*!< 0x40000000 */
#define EXTI2_PRIVCFGR2_PRIV62      EXTI2_PRIVCFGR2_PRIV62_Msk                   /*!< SEC/PRIV enable on event input 62 */
#define EXTI2_PRIVCFGR2_PRIV63_Pos  (31U)
#define EXTI2_PRIVCFGR2_PRIV63_Msk  (0x1UL << EXTI2_PRIVCFGR2_PRIV63_Pos)         /*!< 0x80000000 */
#define EXTI2_PRIVCFGR2_PRIV63      EXTI2_PRIVCFGR2_PRIV63_Msk                   /*!< SEC/PRIV enable on event input 63 */

