STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_cm33.h
/***************  Bit definition for PKA_HWCFGR register  ***************/
#define PKA_HWCFGR_CFG1_Pos       (0U)
#define PKA_HWCFGR_CFG1_Msk       (0xFUL << PKA_HWCFGR_CFG1_Pos)        /*!< 0x0000000F */
#define PKA_HWCFGR_CFG1           PKA_HWCFGR_CFG1_Msk                  /*!< HW Generic 1 */
#define PKA_HWCFGR_CFG2_Pos       (4U)
#define PKA_HWCFGR_CFG2_Msk       (0xFUL << PKA_HWCFGR_CFG2_Pos)        /*!< 0x000000F0 */
#define PKA_HWCFGR_CFG2           PKA_HWCFGR_CFG2_Msk                  /*!< HW Generic 2 */

/****************  Bit definition for PKA_VERR register  ****************/
#define PKA_VERR_MINREV_Pos       (0U)
#define PKA_VERR_MINREV_Msk       (0xFUL << PKA_VERR_MINREV_Pos)        /*!< 0x0000000F */
#define PKA_VERR_MINREV           PKA_VERR_MINREV_Msk                  /*!< Minor revision */
#define PKA_VERR_MAJREV_Pos       (4U)
#define PKA_VERR_MAJREV_Msk       (0xFUL << PKA_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define PKA_VERR_MAJREV           PKA_VERR_MAJREV_Msk                  /*!< Major revision */

/***************  Bit definition for PKA_IPIDR register  ****************/
#define PKA_IPIDR_ID_Pos          (0U)
#define PKA_IPIDR_ID_Msk          (0xFFFFFFFFUL << PKA_IPIDR_ID_Pos)    /*!< 0xFFFFFFFF */
#define PKA_IPIDR_ID              PKA_IPIDR_ID_Msk                     /*!< Identification Code */

/****************  Bit definition for PKA_SIDR register  ****************/
#define PKA_SIDR_SID_Pos          (0U)
#define PKA_SIDR_SID_Msk          (0xFFFFFFFFUL << PKA_SIDR_SID_Pos)    /*!< 0xFFFFFFFF */
#define PKA_SIDR_SID              PKA_SIDR_SID_Msk                     /*!< Size Identification Code */

/*******************  Bits definition for PKA RAM  *************************/
#define PKA_RAM_OFFSET                                 (0x0400UL)                   /*!< PKA RAM address offset */

/* Compute Montgomery parameter input data */
#define PKA_MONTGOMERY_PARAM_IN_MOD_NB_BITS       ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_MONTGOMERY_PARAM_IN_MODULUS           ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input modulus */

/* Compute Montgomery parameter output data */
#define PKA_MONTGOMERY_PARAM_OUT_PARAMETER        ((0x620U - PKA_RAM_OFFSET)>>2)   /*!< Output Montgomery parameter */

/* Compute modular exponentiation input data */
#define PKA_MODULAR_EXP_IN_EXP_NB_BITS            ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input exponent number of bits */
#define PKA_MODULAR_EXP_IN_OP_NB_BITS             ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_MODULAR_EXP_IN_MONTGOMERY_PARAM       ((0x620U - PKA_RAM_OFFSET)>>2)   /*!< Input storage area for Montgomery parameter */
#define PKA_MODULAR_EXP_IN_EXPONENT_BASE          ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input base of the exponentiation */
#define PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE  ((0x16C8U - PKA_RAM_OFFSET)>>2)  /*!< Input base of the exponentiation(protected) */
#define PKA_MODULAR_EXP_IN_EXPONENT               ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Input exponent to process */
#define PKA_MODULAR_EXP_PROTECT_IN_EXPONENT       ((0x14B8U - PKA_RAM_OFFSET)>>2)  /*!< Input exponent to process (protected) */
#define PKA_MODULAR_EXP_IN_MODULUS                ((0x1088 - PKA_RAM_OFFSET)>>2)   /*!< Input modulus */
#define PKA_MODULAR_EXP_PROTECT_IN_MODULUS        ((0x838U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus (protected) */
#define PKA_MODULAR_EXP_PROTECT_IN_PHI            ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input Phi (protected) */

/* Compute modular exponentiation output data */
#define PKA_MODULAR_EXP_OUT_MONTGOMERY_PARAM      ((0x620U - PKA_RAM_OFFSET)>>2)   /*!< Output storage area for Montgomery parameter */
#define PKA_MODULAR_EXP_OUT_SM_ALGO_ACC1          ((0x838U - PKA_RAM_OFFSET)>>2)   /*!< Output SM algorithm accumulator 1 */
#define PKA_MODULAR_EXP_OUT_RESULT                ((0x838U - PKA_RAM_OFFSET)>>2)   /*!< Output for modular exponentiation */
#define PKA_MODULAR_EXP_OUT_ERROR                 ((0x1298U - PKA_RAM_OFFSET)>>2)  /*!< Output error code*/
#define PKA_MODULAR_EXP_OUT_EXPONENT_BASE              ((0x0C68UL - PKA_RAM_OFFSET)>>2)    /*!< Output base of the exponentiation */

/* Compute ECC scalar multiplication input data */
#define PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS         ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input exponent number of bits */
#define PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS          ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN        ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_SCALAR_MUL_IN_A_COEFF             ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECC_SCALAR_MUL_IN_B_COEFF             ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'b' coefficient */
#define PKA_ECC_SCALAR_MUL_IN_MOD_GF              ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input modulus GF(p) */
#define PKA_ECC_SCALAR_MUL_IN_N_PRIME_ORDER       ((0xF88U - PKA_RAM_OFFSET)>>2)   /*!< Input curve prime order n */

#define PKA_ECC_SCALAR_MUL_IN_K                   ((0x12A0U - PKA_RAM_OFFSET)>>2)  /*!< Input 'k' of KP */
#define PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X     ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y     ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */

/* Compute ECC scalar multiplication output data */
#define PKA_ECC_SCALAR_MUL_OUT_RESULT_X           ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Output result X coordinate */
#define PKA_ECC_SCALAR_MUL_OUT_RESULT_Y           ((0x5D0U - PKA_RAM_OFFSET)>>2)   /*!< Output result Y coordinate */
#define PKA_ECC_SCALAR_MUL_OUT_ERROR              ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Output error code */

/* Point check input data */
#define PKA_POINT_CHECK_IN_MOD_NB_BITS            ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_POINT_CHECK_IN_A_COEFF_SIGN           ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_POINT_CHECK_IN_A_COEFF                ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_POINT_CHECK_IN_B_COEFF                ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'b' coefficient */
#define PKA_POINT_CHECK_IN_MOD_GF                 ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus GF(p) */
#define PKA_POINT_CHECK_IN_INITIAL_POINT_X        ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_POINT_CHECK_IN_INITIAL_POINT_Y        ((0x5D0U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_POINT_CHECK_IN_MONTGOMERY_PARAM       ((0x4C8U - PKA_RAM_OFFSET)>>2)   /*!< Input Montgomery parameter R2 mod n */

/* Point check output data */
#define PKA_POINT_CHECK_OUT_ERROR                 ((0x680U - PKA_RAM_OFFSET)>>2)   /*!< Output error code */

/* ECDSA signature input data */
#define PKA_ECDSA_SIGN_IN_ORDER_NB_BITS           ((0x400U - PKA_RAM_OFFSET)>>2)   /*!< Input order number of bits */
#define PKA_ECDSA_SIGN_IN_MOD_NB_BITS             ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_ECDSA_SIGN_IN_A_COEFF_SIGN            ((0x410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECDSA_SIGN_IN_A_COEFF                 ((0x418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECDSA_SIGN_IN_B_COEFF                 ((0x520U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'b' coefficient (positive) */
#define PKA_ECDSA_SIGN_IN_MOD_GF                  ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input modulus GF(p) */
#define PKA_ECDSA_SIGN_IN_K                       ((0x12A0U - PKA_RAM_OFFSET)>>2)  /*!< Input k value of the ECDSA */
#define PKA_ECDSA_SIGN_IN_INITIAL_POINT_X         ((0x578U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y         ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_ECDSA_SIGN_IN_HASH_E                  ((0xFE8U - PKA_RAM_OFFSET)>>2)   /*!< Input e, hash of the message */
#define PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D           ((0xF28U - PKA_RAM_OFFSET)>>2)   /*!< Input d, private key */
#define PKA_ECDSA_SIGN_IN_ORDER_N                 ((0xF88U - PKA_RAM_OFFSET)>>2)   /*!< Input n, order of the curve */

/* ECDSA signature output data */
#define PKA_ECDSA_SIGN_OUT_ERROR                  ((0xFE0U - PKA_RAM_OFFSET)>>2)   /*!< Output error code*/
#define PKA_ECDSA_SIGN_OUT_SIGNATURE_R            ((0x730U - PKA_RAM_OFFSET)>>2)   /*!< Output signature r */
#define PKA_ECDSA_SIGN_OUT_SIGNATURE_S            ((0x788U - PKA_RAM_OFFSET)>>2)   /*!< Output signature s */
#define PKA_ECDSA_SIGN_OUT_FINAL_POINT_X          ((0x1400U - PKA_RAM_OFFSET)>>2)  /*!< Output kG x coordinate */
#define PKA_ECDSA_SIGN_OUT_FINAL_POINT_Y          ((0x1458U - PKA_RAM_OFFSET)>>2)  /*!< Output kG y coordinate */

/* ECDSA verification input data */
#define PKA_ECDSA_VERIF_IN_ORDER_NB_BITS          ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input order number of bits */
#define PKA_ECDSA_VERIF_IN_MOD_NB_BITS            ((0x4C8U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_ECDSA_VERIF_IN_A_COEFF_SIGN           ((0x468U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECDSA_VERIF_IN_A_COEFF                ((0x470U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECDSA_VERIF_IN_MOD_GF                 ((0x4D0U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus GF(p) */
#define PKA_ECDSA_VERIF_IN_INITIAL_POINT_X        ((0x678U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y        ((0x6D0U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */
#define PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X     ((0x12F8U - PKA_RAM_OFFSET)>>2)  /*!< Input public key point X coordinate */
#define PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y     ((0x1350U - PKA_RAM_OFFSET)>>2)  /*!< Input public key point Y coordinate */
#define PKA_ECDSA_VERIF_IN_SIGNATURE_R            ((0x10E0U - PKA_RAM_OFFSET)>>2)  /*!< Input r, part of the signature */
#define PKA_ECDSA_VERIF_IN_SIGNATURE_S            ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input s, part of the signature */
#define PKA_ECDSA_VERIF_IN_HASH_E                 ((0x13A8U - PKA_RAM_OFFSET)>>2)  /*!< Input e, hash of the message */
#define PKA_ECDSA_VERIF_IN_ORDER_N                ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input n, order of the curve */

